Repository: hfukuchi/Linux_Kernel_Release_Model
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: (and that one goes to the private security list just because we don't want
ja: （何故プライベートで送るかというと、世界中の人がその問題をテストしようとするのを

source: - People don't think it matters
ja: - 人々は、それを重要と考えない。

source: - people think the marking is somehow trustworthy.
ja: - 人々がマークは信用できると考えている

source: > > I'm just saying that why mark things, when the marking have no meaning?
ja: > > 私は、ただ、マークの意味がないのに、何のためにマークを付けるのか、と言っているだけです。

source: > > People who believe in them are just _wrong_.
ja: > > それを信じている人は本当に間違っています。

source: > bug, why is it wrong to say so in the commit?
ja: > コミットの中でそれに言及するのがなぜ悪いのですか？

source: > commits
ja: > 取り除かれているからです。

source: > fixing a security issue.
ja: > いうためにマークするのでしょう。

source: > in other words, it's all the more reason to have the commit say it's
ja: > 別の言い方をすれば、そのコミットがセキュリティ不具合を修正していると

source: > security bugs
ja: > セキュリティに関するアナウンスが無いことがわかるでしょう。

source: > the announcement doesn't ever mention the word 'security' while fixing
ja: > セキュリティ不具合を修正しているにもかかわらず

source: > treated as normal bugs because you do omit relevant information from such
ja: > 普通の不具合のように扱われません。というのも、コミットから関連する情報が

source: > we went through this and you yourself said that security bugs are *not*
ja: > 我々はこれをやります。あなたが言ったようにセキュリティ不具合は

source: > what is wrong in particular?
ja: > 特に、何が間違っているのでしょうか。

source: > when you know that you're about to commit a patch that fixes a security
ja: > セキュリティ不具合を修正するパッチをコミットしようとするとき、

source: > you should check out the last few -stable releases then and see how
ja: > ここ数回のStableリリースをチェックしてみるべきです。

source: A new release happened every 2 to 3 months, and that release was declared “stable” and recommended for all users to run.
ja: 新リリースは、2、3か月ごとに実行されます。該当するリリースは「Stable」と宣言され、全ユーザーがそれを使うことを推奨されます。

source: A non-scientific study (i.e. Greg’s mailbox) shows that each change needs to be submitted 2-3 times before it is accepted into the kernel source tree due to the rigorous review and testing process that all kernel changes are put through, so the engineering effort happening is much larger than the 8 changes per hour.
ja: 非科学的な調査（つまり、グレッグのメールボックス）によると、各変更は、Kernelソース ツリーへ受領されるまでに2、3回の再提出を必要としています。というのも、全変更提案がパスする必要がある非常に厳しいレビューとテストプロセスのためで、実際にかかっているエンジニアリング労力は1時間に8変更に対応するよりもずっと大きなものになっています。

source: A stable kernel change:
ja: Stable Kernelへの変更は：

source: Actually, we disagree on one fundamental thing.
ja: 基本的なところで同意できません。

source: After Linus releases a new kernel, the previous stable kernel release tree is stopped and users must move to the newer released kernel.
ja: リーナスが新しいKernelをリリースした後は、前Stable Kernelツリーの保守は終了しますので、ユーザーは新しくリリースされたKernelへ移行するべきです。

source: After a year of this new stable release process, it was determined that many different users of Linux wanted a kernel to be supported for longer than just a few months.
ja: この新しいStableリリース プロセスを1年実施してみたところ、多くのLinuxユーザーはほんの数か月ではなくもっと長くKernelを保守してほしいと願っていることが分かりました。

source: After that was very successful, and allowed developers to share work across companies, those companies decided to not do that anymore, so future LTS kernels were picked on an individual distribution’s needs and maintained by different developers (3.0.y, 3.2.y, 3.12.y, 3.16.y, and 3.18.y) creating more work and confusion for everyone involved.
ja: このモデルは大変成功し、開発者は企業を超えて作業を分担することができましたが、その後、企業は企業間で分担することをやめさせました。将来のLTS Kernelはある特定のディストリビューションの要望に基づいて選定され、異なる開発者によって保守されることになりましたが、これは関係者に大きな作業と混乱をもたらすことになりました。（3.0.y, 3.2.y, 3.12.y, 3.16.y, 3.18.y）

source: All problems and mistakes in here are, of course, all mine.
ja: 勿論、すべての問題や誤りは、私に全責任があります。

source: Along with these three kernel releases, a few older kernels are still being maintained by some kernel developers at a slower release cycle due to the needs of some users and distributions.
ja: これらの3つのKernelリリースとは別に、少数の古いKernelはKernel開発者によって保守され続けていますが、あるユーザーやディストリビューションの要望に応える形でもっとゆっくりとしたリリース サイクルになっています。

source: Also, many bugfixes are only determined to be security related after much time has passed, so to keep users from getting a false sense of security by not taking patches, the kernel community strongly recommends always taking all bugfixes that are released.
ja: 多くの不具合修正はかなり時間が経過した後でしか決められないです。セキュリティへの言及が無いからといって、ユーザーがパッチを適用しないことがないように、Kernelコミュニティはリリースされたすべての不具合修正を適用するように強く推奨します。

source: An average laptop uses around 2 million lines of kernel code from 5 thousand files to function properly, while the Pixel phone uses 3.2 million lines of kernel code from 6 thousand files due to the increased complexity of a SoC.
ja: 平均的なラップトップPCは、動作させるのに5,000ファイル、200万行程度のKernelコードを使っていますが、一方で、スマートフォンは6,000ファイル、320万行程度のKernelコードを使います。これは、使用しているSoCの増加する複雑さによるものです。

source: And I take mostly
ja: 私はほとんど

source: Any code that is merged into a device’s kernel that is not in the kernel.org releases is unknown and interactions with it can never be planned for, or even considered.
ja: kernel.orgのリリースに記載がないデバイスのKernelにマージされるコードは、未知のものであり、それとの相互作用は計画も検討もされていません。

source: As are new features, for that
ja: 新しい機能として、それは

source: As described above, the changes are almost never described as a “security fix”, but rather look like any other bugfix for the kernel.
ja: 上に述べたように、こうした変更は、Kernelの不具合修正と同じように扱われ、「セキュリティ修正」と記載されることはまずありません。

source: At the current kernel release rate, the number will change to 5.x sometime in 2018.
ja: 現在のKernelリリースの頻度からいくと、2018年に5.xへの変更があるでしょう。

source: At the end of 2017 the size of the Linux kernel was just over 61 thousand files consisting of 25 million lines of code, build scripts, and documentation (kernel release 4.14).
ja: 2017年末の時点で、Linux Kernelの規模は、コード、ビルド スクリプト、文書を含めて6,100ファイル以上、2,500万行以上に達しています。（kernel release 4.14）

source: Because of the large out-of-tree patchsets, most SoC vendors are starting to standardize on using the LTS releases for their devices.
ja: 大きなツリー外パッチセットが理由で、ほとんどのSoCベンダーは、自社のデバイスにLTSリリースを使うことを標準化しようとしています。

source: Because of this, Greg Kroah-Hartman decided that the choice of the LTS kernel needed to change to a method in which companies can plan on using the LTS kernel in their products.
ja: こうした理由で、グレッグ クロー ハートマンは、LTS Kernel選定を、企業がLTS Kernelを使った製品の計画ができる方法に改める必要があると判断しました。

source: Because of this, an individual system only runs a fraction of the whole codebase.
ja: このため、個別システムは、全コードベース中の一部分だけを使用しています。

source: Because of this, the Long Term Supported (LTS) kernel release came about.
ja: これを背景として、長期保守（LTS）Kernelリリースが登場しました。

source: Because of this, the stable kernel releases were started.
ja: こうしたことから、Stable Kernelリリースが開始されたのです。

source: Because security bugs are not announced to the public by the kernel team, CVE numbers for Linux kernel-related issues are usually released weeks, months, and sometimes years after the fix was merged into the stable and development branches, if at all.
ja: セキュリティ不具合はKernelチームから一般にアナウンスされません。ですから、Linux Kernel関連問題のCVE番号は、もしあったとしても、通常、修正がStableと開発ブランチにマージされてから数週間後、数か月後、時には数年後にリリースされます。

source: Choosing the LTS kernel
ja: LTS Kernelの選定

source: Currently the LTS kernels are the 4.4.y, 4.9.y, and 4.14.y releases, and a new kernel is released on average, once a week.
ja: 本稿著作時のLTS Kernelは、リリース4.4.y、4.9.y、4.14.yです。これらに対する新しいKernelは、平均すると週に1回程度リリースされます。

source: Devices based on Linux that have large patchsets can have major issues when updating to newer kernels, because of the huge number of changes between each release.
ja: Linuxを採用するデバイスは、大きなパッチセットを持っており、新しいKernelへアップデートする際に大きな問題を抱える可能性があります。というのもリリース間で莫大な数の変更をする必要があるからです。

source: Due to a large number of different LTS kernels being released all in the same year, causing lots of confusion for vendors and users, the rule of no new LTS kernels being based on an individual distribution’s needs was created.
ja: 同じ年に異なるすべてのLTS Kernelから多数のリリースが行われて、ベンダーもユーザーも混乱したことから、個々のディストリビューションの要望に応じたLTS Kernelは今後作成されないことが決められました。

source: During this process, the LTS kernel would only be announced after the release happened, making it hard for companies to plan ahead of time what to use in their new product, causing lots of guessing and misinformation to be spread around.
ja: このプロセスでは、LTS Kernelはリリースされた後にしか宣言されませんので、このことは、企業が製品へどのKernelを利用するか事前に計画するのを難しくし、多くの推測や誤った情報が広まる原因ともなりました。

source: Each stable kernel release tree is maintained by a single kernel developer, who is responsible for picking the needed patches for the release, and doing the review/release process.
ja: 各Stalbe Kernelリリース ツリーは、一人のKernel開発者によって保守されます。その開発者が、リリースする必要があるパッチを選択し、レビュー／リリース プロセスを実行します。

source: FEB 5TH, 2018
ja: 2月5日木曜日 2018年

source: For example, the 4.9 kernel is released by Linus, and then the stable kernel releases based on this kernel are numbered 4.9.1, 4.9.2, 4.9.3, and so on.
ja: たとえば、Kernel 4.9がリーナスからリリースされますと、このKernelリリースに対応するStable Kernelリリースは、4.9.1, 4.9.2, 4.9.3, というように番号付けられていきます。

source: For example, the way I prefer to work is to have people send me and the
ja: 例えば、私の好きな仕事のやり方は、人が私とKernel List宛に修正パッチを送ってくれて、

source: Full details of how security bugs can be reported to the kernel community in order to get them resolved and fixed as soon as possible can be found in the kernel file Documentation/admin-guide/security-bugs.rst
ja: セキュリティ不具合を可能な限り早期に修正するための、Kernelコミュニティへの報告方法は、KernelファイルDocumentation/admin-guide/security-bugs.rstに詳細な説明があります。

source: Future LTS kernels should be planned based on this release cycle (the last kernel of the year).
ja: 将来のLTS Kernelは、このリリース サイクルを基に計画するべきでしょう。（つまり、その年の最後のKernel）

source: Hell no.
ja: とんでもない。

source: Hopefully that will allow the SoC vendors to continue to update their device kernels in order to provide more secure devices for their users.
ja: こうしたやり方を採用すると、SoCベンダーがユーザーに対してセキュアなデバイスを提供するために、デバイスのKernelを継続してアップデートすることが可能となるでしょう。

source: However, the older a kernel is, the harder it is to backport the changes that are needed to be applied, due to the changes in the codebase.
ja: しかしながら、コードベースが変化していきますので、Kernelが古いほど、必要な不具合修正を適用させるのはより難しくなります。

source: I do not think it's helpful _or_ relevant to explicitly point out how to
ja: その不具合を再現する方法を明白に説明することに、それが役立ち、関連するとは

source: I don't want to do it,
ja: そうしたくないのです

source: I expressly told you that security bugs should not be marked as such,
ja: はっきりと言いましたが、セキュリティ不具合はそういうようにマークするべきではないです。

source: I then used it as a basis of a presentation I gave at the Linux Recipes conference in September 2017 which can be seen here.
ja: Linux Recipes conference in September 2017（https://kernel-recipes.org/en/2017/）での私の発表も、この内容を基にしました。（ここで見られますhttps://www.youtube.com/watch?v=RKadXpQLmPU）

source: I think pointing it out is actually likely to be
ja: それを指し示すことは反生産的なものだと

source: I would like to thank the reviewers who helped shape the original whitepaper, which has helped many companies understand that they need to stop “cherry picking” random patches into their device kernels.
ja: 最初のホワイトペーパーが世に出るのを助けてくれたレビュワーに感謝します。このホワイトペーパーは、自分たちのデバイスに使っているKernelへのパッチの「つまみ食い」を止めた方がいいと多くの企業に理解させるのに役立ちました。

source: If you notice any, or have any questions about this, please let me know.
ja: もし、何か気づいたことや質問があれば、私までお知らせ下さい。

source: In 2017, over 4,300 different developers from over 530 different companies contributed to the project.
ja: 2017年には、530を超える企業の4300人以上の開発者がプロジェクトへ貢献しました。

source: In July 2011, Linus Torvalds changed the version number to 3.x after the 2.6.39 kernel was released.
ja: 2011年7月にKernel 2.6.39がリリースされた後に、リーナス トーバルズ（Linus Torvalds）は、Kernelバージョンを3.xに変更しました。

source: In either case it's just stupid to mark them.
ja: いずれのケースも、マークするのはバカげています。

source: Information about all long-term stable kernels, who is in charge of them, and how long they will be maintained, can be found on the kernel.org release page.
ja: すべてのLTS Kernelの情報（誰が責任者か、いつまで保守されるか）については kernel.org release pageで見ることができます。

source: It is encouraging to see that the Android project has standardized on the LTS kernels as a “minimum kernel version requirement”.
ja: Androidプロジェクトが「最低限のKernelバージョン要求（minimum kernel version requirement）」としてLTS Kernelを標準化しているのを 是非参考にして下さい。

source: It is not remembered if any whisky exchanged hands when this happened.
ja: この時に、お酒が手渡されたかどうかは定かではありません。

source: It was real
ja: 開発者が

source: It's
ja: その理由で

source: It's pointless and wrong because it makes people think that other bugs
ja: それは意味がないし、間違ってもいます。というのも、そのやり方は、人々に、他の不具合で

source: It's very helpful and relevant when we're trying to chase
ja: 不具合を追いかけているときには、それは役立ち、関連もするでしょう。

source: Keeping a secure system
ja: システムをセキュアに保つ

source: Kernel Updates
ja: Kernelアップデート

source: Kernel release model
ja: Kernelリリースモデル

source: LTS kernel releases average 9-10 patches accepted per day, while the normal stable kernel releases contain 10-15 patches per day.
ja: 普通のStable Kernelリリースが1日に10から15のパッチを受領するのに対して、LTS Kernelリリースは、平均して9から10のパッチを受領します。

source: Linus
ja: リーナス

source: Linus summarized the reasoning behind this behavior in an email to the Linux Kernel mailing list in 2008:
ja: リーナスは、2008年にLinux Kernel MLに出したメールの中で、この行動の背後にある理由についてまとめています。

source: Linus describes this method of development in the same email thread:
ja: リーナスは、 同じEmailのスレッドでこの開発手法を説明しています。

source: Linux Kernel Release Model
ja: Linux Kernelリリース モデル

source: Linux Kernel development model
ja: Linux Kernel開発モデル

source: Most SoC vendors do want to get their code merged upstream before their chips are released, but the reality of project-planning cycles and ultimately the business priorities of these companies prevent them from dedicating sufficient resources to the task.
ja: ほとんどのSoCベンダーは、自分たちのチップが出荷される前に彼らのコードをアップストリームへマージしたいと思っています。しかし、プロジェクト計画サイクルの現実と、究極的には企業のビジネス優先度が、アップストリーム作業に十分な時間を割くことを阻んでいます。

source: No.
ja: 違います。

source: Note
ja: 初めに

source: On average, 8.5 changes are accepted into the Linux kernel every hour, every hour of the day.
ja: 平均すると、1日の1時間、1時間ごとに8.5個の変更がLinux Kernelで受け付けられています。

source: Originally it was merely based on what kernel the stable maintainer’s employer was using for their product (2.6.16.y and 2.6.27.y) in order to make the effort of maintaining that kernel easier.
ja: 当初は、Stableメンテナーの所属する企業が製品に利用しているKernelが、保守を楽にする目的で選ばれました。(2.6.16.y and 2.6.27.y)

source: Other distribution maintainers saw the benefit of this model and got together and colluded to get their companies to all release a product based on the same kernel version without realizing it (2.6.32.y).
ja: この保守モデルの利点に気づいた他のディストリビューション メンテナーたちは、皆で結託して彼らの企業をそそのかし、企業は気づかないままに同じKernelバージョンを製品に載せました。(2.6.32.y)

source: Overview
ja: 全般

source: People are WRONG, and are misled by the partial markings, thinking that
ja: 人々は間違っていて、部分マーキングを誤解して、

source: People are right, and the marking is pointless.
ja: 人々は正しく、マーキングは無意味である。

source: Regressions do happen, but those are the highest priority bugs and are either quickly fixed, or the change that caused the regression is quickly reverted from the Linux kernel tree.
ja: リグレッションが発生すると、最優先の不具合となります。これらは、すぐに解決されるか、そうでなければリグレッションを起こしている変更をLinux Kernelツリーからすぐに外します。

source: Security
ja: セキュリティ

source: See the next section for how a kernel is chosen to be a LTS release.
ja: LTS Kernelの選定方法については、次節をご覧下さい。

source: Should I document the exploit in the commit message?
ja: 悪用方法をコミットメッセージに書くべき？

source: Since then, a new LTS kernel has been picked once a year.
ja: それ以降、新しいLTS Kernelは、毎年1つずつ選定されています。

source: So while there might be a lower number of overall patches being applied, the effort involved in maintaining a LTS kernel is greater than maintaining the normal stable kernel.
ja: 適用されるパッチの数は少ないですが、LTS Kernelを保守するのに要する労力は、通常のStable Kernelを維持するよりも大きなものとなります。

source: SoC patchsets are especially known to have issues with updating to newer kernels due to their large size and heavy modification of architecture specific, and sometimes core, kernel code.
ja: 特にSoCのパッチセットは、新しいKernelへのアップデートに伴う問題を持っていることが知られています。これは、アーキテクチャに由来する大規模で重い変更と、時には核となる部分、Kernelコードにも変更をしているためです。

source: Stable kernel patch rules
ja: Stable Kernelパッチ規則

source: Stable kernel releases
ja: Stable Kernelリリース

source: Stable kernels are maintained for as long as the current development cycle is happening.
ja: Stable Kernelは、現在の開発サイクルが実行されている間だけ保守されます。

source: THAT is how things
ja: それが、

source: That kernel will be maintained by the kernel community for at least 2 years.
ja: このKernelは、Kernelコミュニティによって最低でも2年間保守されます。

source: That promise was made in 2007 at the annual Kernel developer summit in Cambridge, England, and still holds true today.
ja: これは、2007年にイギリスのケンブリッジで開催された年次Kernel Developer Summitで約束され、今日に至るまで守られています。

source: The Linux kernel community has promised its userbase that no upgrade will ever break anything that is currently working in a previous release.
ja: Linux Kernelコミュニティは、ユーザーに対して、前リリースで動作している機能はアップグレードしても損なわれないことを約束しました。

source: The Linux kernel contains the code for all of the different chip architectures and hardware drivers that it supports.
ja: Linux Kernelは、サポートしているすべてのアーキテクチャとハードウェア ドライバに対するコードを含みます。

source: The Linux kernel is the largest collaborative software project ever.
ja: Linux kernelは、これまでで最大のコラボレイティブ ソフトウェア開発プロジェクトです。

source: The Linux kernel stable release model started in 2005, when the existing development model of the kernel (a new release every 2-3 months) was determined to not be meeting the needs of most users.
ja: Linux Kernel Stableリリース モデルは、2005年に始まりました。既存のKernl開発モデル（2、3か月ごとに新リリース）が、ほとんどのユーザーのニーズを満たしていないと判断されたのです。

source: The change to the 3.x numbering series did not mean anything other than a change of the major release number, and this happened again in April 2015 with the movement from the 3.19 release to the 4.0 release number.
ja: 3.x番号付けへの変更は、メジャー リリース番号の変更以外の意味はありません。2015年4月に、再び、3.19から4.0へのリリース番号の変更がありました。

source: The community never wants a fix to go into a stable kernel release that is not already in Linus’s tree so that anyone who upgrades should never see a regression.
ja: コミュニティは、リーナス ツリーに入ってない修正がStable Kernelに入ることを望みません、こうすることで、Kernelをアップグレードした時にリグレッションを経験せずに済みます。

source: The fallout of that mess took many months to unwind and stabilize the kernel to a proper level.
ja: この混乱を収拾してKernelを適切なレベルに戻すのに数か月を要しました。

source: The first LTS kernel was 2.6.16, released in 2006.
ja: 最初のLTS Kernelは、2006年にリリースされたバージョン2.6.16でした。

source: The full list of the rules for patches to be accepted into a stable kernel release can be found in the Documentation/process/stable_kernel_rules.rstkernel file and are summarized here.
ja: Stable Kernelリリースで受領できるパッチについての規則は、Documentation/process/stable_kernel_rules.rstファイルに書いてあります。ここでは要約を書きます。

source: The kernel community can only make this promise for the code that is merged into the Linux kernel tree.
ja: Kernelコミュニティは、Linux Kernelツリーにマージされるコードに対してのみこの約束をしています。

source: The kernel community discussed this issue at its annual meeting and decided to mark the 4.4.y kernel as a LTS kernel release, much to the surprise of everyone involved, with the goal that the next LTS kernel would be planned ahead of time to be based on the last kernel release of 2016 in order to provide enough time for companies to release products based on it in the next holiday season (2017).
ja: Kernelコミュニティは、年次会議でこの問題を議論した上で、関係者すべてが大きく驚いたことにKernel 4.4.yをLTS Kernelとすることを決定しました。次のホリデーシーズン（2017年）向け製品の投入を計画する十分な時間を企業に与えるために、次のLTS Kernelは2016年の最後のKernelリリースと決められたのです。

source: The last rule, “a change must be in Linus’s tree”, prevents the kernel community from losing fixes.
ja: 最後の規則「リーナス ツリーに既にマージされていなくてはならない」は、Kernelコミュニティが修正をし忘れないようにあります。

source: The method of picking which kernel the LTS release will be, and who will maintain it, has changed over the years from an semi-random method, to something that is hopefully more reliable.
ja: LTS Kernelの選定とメンテナーの選定は、数年の間に、半分無作為な方法から、もっと信頼性があると思える方法へと変わりました。

source: The number of patches fluctuates per release given the current time of the corresponding development kernel release, and other external variables.
ja: パッチ数は、開発Kernelリリースの影響やその他外部要因によって、リリースごとに変動します。

source: The numbering of the kernel releases started out being 2.6.x, where x was an incrementing number that changed on every release The value of the number has no meaning, other than it is newer than the previous kernel release.
ja: Kernelのバージョン番号付けは2.6.xから始めました。Xは、リリースごとに増加する数字を意味します。数字は、前Kernelリリースよりも新しいことを示す以外に特別な意味はありません。

source: The numbering of the stable releases starts with the number of the kernel release, and an additional number is added to the end of it.
ja: Stableリリースの番号付けは、Kernelリリースの番号から始まり、その後ろに追加番号が付きます。

source: The older a LTS kernel is, the less patches are applicable to it, because many recent bugfixes are not relevant to older kernels.
ja: 多くの新しい不具合修正は古いKernelに無関係ですので、LTS Kernelが古いほど、適用可能なパッチの数は少なくなります。

source: The rule became “one kernel will be picked each year, and will be maintained for two years.” With that rule, the 3.4.y, 3.10.y, and 3.14.y kernels were picked.
ja: 規則は、「毎年1つのKernelが選定され、2年間保守される」となりました。この規則に従って、Kernel 3.4.y、3.10.y、 3.14.yが選定されました。

source: The rules for what can be added to a stable kernel release have remained almost identical for the past 12 years.
ja: Stable Kernelリリースに何を加えることができるかについての規則は、過去12年間ほとんどそのまま維持されてきました。

source: There were 5 different releases in 2017, with each release containing between 12,000 and 14,500 different changes.
ja: 2017年には5回のリリースが行われ、毎回12,000から14,500か所の変更が入っています。

source: These releases are based directly on Linus’s releases, and are released every week or so, depending on various external factors (time of year, available patches, maintainer workload, etc.)
ja: これらのリリースは、リーナスのリリースに基づいて、さまざまな外部要因（時節、適用可能なパッチ、メンテナーの付加、等）にも依存しますが、毎週リリースされます。

source: They aren't.
ja: そうではないです。

source: They're all fixes.
ja: すべては修正です。

source: They're all important.
ja: すべては重要です。

source: This ad-hoc method of catering to only specific Linux distributions was not beneficial to the millions of devices that used Linux in an embedded system and were not based on a traditional Linux distribution.
ja: 特定のLinuxディストリビューションの要望にだけ応じる特別な方法は、Linuxを利用しているものの伝統的なLinuxディストリビューションには基づいていない組み込みシステムのデバイスには便益がありませんでした。

source: This allows devices to receive bug and security updates directly from the Linux kernel community, without having to rely on the SoC vendor’s backporting efforts, which traditionally are very slow to respond to problems.
ja: この取り組みによって、伝統的に問題への対応が遅いSoCベンダーのバックポーティングに依存せず、不具合やセキュリティに関するアップデートを直接Linux Kernelコミュニティからデバイスが受け取ることができます。

source: This change in development model was due to the very long release cycle prior to the 2.6 kernel (almost 3 years), and the struggle to maintain two different branches of the codebase at the same time.
ja: この開発モデルの変更は、Kernel 2.6より前の非常に長いリリース サイクル（ほとんど3年程度）と、コードベースの2つの異なるブランチを同時に維持する苦闘が理由で行われました。

source: This email can be found here, and the whole thread is recommended reading for anyone who is curious about this topic.
ja: このEmailはここにあります。このトピックに関心のある方に対して、スレッド全体を読むことを推奨します。

source: This is done to allow affected parties the ability to update their systems before the reporter of the problem announces it.
ja: このやり方ですと、問題の報告者がそれをアナウンスする前に、影響を受ける組織が自分たちのシステムをアップデートすることができます。

source: This is due to the basic problem of the difficulty in determining if a bugfix is a security fix or not at the time of creation.
ja: その不具合修正がセキュリティ修正かどうかをその時点で判断することが難しいからです。

source: This is how the 4.9.y and 4.14.y kernels were picked as the LTS kernel releases.
ja: こうして、Kernel 4.9.yと4.14.yが選定されました。

source: This post describes how the Linux kernel development model works, what a long term supported kernel is, how the kernel developers approach security bugs, and why all systems that use Linux should be using all of the stable releases and not attempting to pick and choose random patches.
ja: この投稿では、Linux Kernel開発モデルがどのように運用されているか、長期保守（long term supported）Kernelとは何物か、Kernel開発者はセキュリティ不具合にどのように挑むか、また、Linuxを利用する全システムはパッチのつまみ食いを止めてすべてのStableパッチを取り込むべきである理由、を説明します。
